RFThings/arduino-STM32L4/boards.txt
menu.usb=USB Type
menu.region_flags=Region
menu.version_flags=Board version
menu.dosfs=DOSFS
menu.speed=CPU Speed
menu.opt=Optimize



# RFThings Design KIT
# ---------------------------------------
RFThings-DK.name=RFThings-DK
RFThings-DK.vid.0=0x1209
RFThings-DK.pid.0=0x6667

RFThings-DK.upload.tool=stm32l4_dfu
RFThings-DK.upload.protocol=dfu
RFThings-DK.upload.maximum_size=1032192
RFThings-DK.upload.use_1200bps_touch=true
RFThings-DK.upload.wait_for_upload_port=false
RFThings-DK.upload.native_usb=false

RFThings-DK.build.mcu=cortex-m4
RFThings-DK.build.f_cpu=80000000L
RFThings-DK.build.board=STM32L4_DK
RFThings-DK.build.arch=STM32L4
RFThings-DK.build.core=stm32l4
RFThings-DK.build.vid=0x1209
RFThings-DK.build.pid=0x6667
RFThings-DK.build.did=0xffff
RFThings-DK.build.usb_manufacturer="RFThings"
RFThings-DK.build.usb_product="DK Platinum"
RFThings-DK.build.extra_flags=-DSTM32L476xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags} {build.region_flags} {build.version_flags}
RFThings-DK.build.ldscript=linker_scripts/STM32L476RE_FLASH.ld
RFThings-DK.build.openocdscript=openocd_scripts/stm32l476re_dragonfly.cfg
RFThings-DK.build.variant=STM32L476RE-DK
RFThings-DK.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l476 -larm_cortexM4lf_math
RFThings-DK.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

RFThings-DK.menu.usb.cdc=Serial
RFThings-DK.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
# RFThings-DK.menu.usb.cdc_msc=Serial + Mass Storage
# RFThings-DK.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
# RFThings-DK.menu.usb.cdc_hid=Serial + Keyboard + Mouse
# RFThings-DK.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
# RFThings-DK.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
# RFThings-DK.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
RFThings-DK.menu.usb.none=No USB (low-power)
RFThings-DK.menu.usb.none.build.usb_type=USB_TYPE_NONE

RFThings-DK.menu.region_flags.EU868=Europe 868
RFThings-DK.menu.region_flags.EU868.build.region=R_EU868
RFThings-DK.menu.region_flags.US915=US 915
RFThings-DK.menu.region_flags.US915.build.region=R_US915
RFThings-DK.menu.region_flags.AU915=AU 915
RFThings-DK.menu.region_flags.AU915.build.region=R_AU915
RFThings-DK.menu.region_flags.AS923=Asia AS923
RFThings-DK.menu.region_flags.AS923.build.region=R_AS923
RFThings-DK.menu.region_flags.IN865=India 865
RFThings-DK.menu.region_flags.IN865.build.region=R_IN865

RFThings-DK.menu.version_flags.V3=V3
RFThings-DK.menu.version_flags.V3.build.version=BOARD_LS200_V3
RFThings-DK.menu.version_flags.V2=V2
RFThings-DK.menu.version_flags.V2.build.version=BOARD_LS200_V2

RFThings-DK.build.dosfs_sdcard=0
RFThings-DK.build.dosfs_sflash=0

RFThings-DK.menu.speed.80=80 MHz
RFThings-DK.menu.speed.80.build.f_cpu=80000000L
RFThings-DK.menu.speed.72=72 MHz
RFThings-DK.menu.speed.72.build.f_cpu=72000000L
RFThings-DK.menu.speed.64=64 MHz
RFThings-DK.menu.speed.64.build.f_cpu=64000000L
RFThings-DK.menu.speed.48=48 MHz
RFThings-DK.menu.speed.48.build.f_cpu=48000000L
RFThings-DK.menu.speed.32=32 MHz
RFThings-DK.menu.speed.32.build.f_cpu=32000000L
RFThings-DK.menu.speed.24=24 MHz
RFThings-DK.menu.speed.24.build.f_cpu=24000000L
RFThings-DK.menu.speed.16=16 MHz
RFThings-DK.menu.speed.16.build.f_cpu=16000000L
RFThings-DK.menu.speed.8=8 MHz (No USB)
RFThings-DK.menu.speed.8.build.f_cpu=8000000L
RFThings-DK.menu.speed.4=4 MHz (No USB)
RFThings-DK.menu.speed.4.build.f_cpu=4000000L
RFThings-DK.menu.speed.2=2 MHz (No USB)
RFThings-DK.menu.speed.2.build.f_cpu=2000000L
RFThings-DK.menu.speed.1=1 MHz (No USB)
RFThings-DK.menu.speed.1.build.f_cpu=1000000L

RFThings-DK.menu.opt.o3=Fastest
RFThings-DK.menu.opt.o3.build.flags.optimize=-O3
RFThings-DK.menu.opt.o3.build.flags.ldspecs=
RFThings-DK.menu.opt.os=Smallest Code
RFThings-DK.menu.opt.os.build.flags.optimize=-Os
RFThings-DK.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
# RFThings-DK.menu.opt.o1=Fast
# RFThings-DK.menu.opt.o1.build.flags.optimize=-O1
# RFThings-DK.menu.opt.o1.build.flags.ldspecs=
# RFThings-DK.menu.opt.o2=Faster
# RFThings-DK.menu.opt.o2.build.flags.optimize=-O2
# RFThings-DK.menu.opt.o2.build.flags.ldspecs=



# Tlera Dragonfly
# ---------------------------------------
Dragonfly-L476RE.name=Dragonfly-L476RE
Dragonfly-L476RE.vid.0=0x1209
Dragonfly-L476RE.pid.0=0x6667

Dragonfly-L476RE.upload.tool=stm32l4_dfu
Dragonfly-L476RE.upload.protocol=dfu
Dragonfly-L476RE.upload.maximum_size=507904
Dragonfly-L476RE.upload.use_1200bps_touch=true
Dragonfly-L476RE.upload.wait_for_upload_port=false
Dragonfly-L476RE.upload.native_usb=false

Dragonfly-L476RE.build.mcu=cortex-m4
Dragonfly-L476RE.build.f_cpu=80000000L
Dragonfly-L476RE.build.board=STM32L4_DRAGONFLY
Dragonfly-L476RE.build.arch=STM32L4
Dragonfly-L476RE.build.core=stm32l4
Dragonfly-L476RE.build.vid=0x1209
Dragonfly-L476RE.build.pid=0x6667
Dragonfly-L476RE.build.did=0xffff
Dragonfly-L476RE.build.usb_manufacturer="Tlera Corporation"
Dragonfly-L476RE.build.usb_product="Dragonfly"
Dragonfly-L476RE.build.extra_flags=-DSTM32L476xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Dragonfly-L476RE.build.ldscript=linker_scripts/STM32L476RE_FLASH.ld
Dragonfly-L476RE.build.openocdscript=openocd_scripts/stm32l476re_dragonfly.cfg
Dragonfly-L476RE.build.variant=STM32L476RE-Dragonfly
Dragonfly-L476RE.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l476 -larm_cortexM4lf_math
Dragonfly-L476RE.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Dragonfly-L476RE.menu.usb.cdc=Serial
Dragonfly-L476RE.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Dragonfly-L476RE.menu.usb.cdc_msc=Serial + Mass Storage
Dragonfly-L476RE.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Dragonfly-L476RE.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Dragonfly-L476RE.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Dragonfly-L476RE.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
Dragonfly-L476RE.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Dragonfly-L476RE.menu.usb.none=No USB
Dragonfly-L476RE.menu.usb.none.build.usb_type=USB_TYPE_NONE

Dragonfly-L476RE.menu.dosfs.sflash=SFLASH (QSPI)
Dragonfly-L476RE.menu.dosfs.sflash.build.dosfs_sdcard=0
Dragonfly-L476RE.menu.dosfs.sflash.build.dosfs_sflash=2
Dragonfly-L476RE.menu.dosfs.sdspi=SDCARD (SPI)
Dragonfly-L476RE.menu.dosfs.sdspi.build.dosfs_sdcard=1
Dragonfly-L476RE.menu.dosfs.sdspi.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.sdmmc=SDCARD (SDIO Default Speed)
Dragonfly-L476RE.menu.dosfs.sdmmc.build.dosfs_sdcard=2
Dragonfly-L476RE.menu.dosfs.sdmmc.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.sdmmc1=SDCARD (SDIO High Speed)
Dragonfly-L476RE.menu.dosfs.sdmmc1.build.dosfs_sdcard=3
Dragonfly-L476RE.menu.dosfs.sdmmc1.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.none=None
Dragonfly-L476RE.menu.dosfs.none.build.dosfs_sdcard=0
Dragonfly-L476RE.menu.dosfs.none.build.dosfs_sflash=0

Dragonfly-L476RE.menu.speed.80=80 MHz
Dragonfly-L476RE.menu.speed.80.build.f_cpu=80000000L
Dragonfly-L476RE.menu.speed.72=72 MHz
Dragonfly-L476RE.menu.speed.72.build.f_cpu=72000000L
Dragonfly-L476RE.menu.speed.64=64 MHz
Dragonfly-L476RE.menu.speed.64.build.f_cpu=64000000L
Dragonfly-L476RE.menu.speed.48=48 MHz
Dragonfly-L476RE.menu.speed.48.build.f_cpu=48000000L
Dragonfly-L476RE.menu.speed.32=32 MHz
Dragonfly-L476RE.menu.speed.32.build.f_cpu=32000000L
Dragonfly-L476RE.menu.speed.24=24 MHz
Dragonfly-L476RE.menu.speed.24.build.f_cpu=24000000L
Dragonfly-L476RE.menu.speed.16=16 MHz
Dragonfly-L476RE.menu.speed.16.build.f_cpu=16000000L
Dragonfly-L476RE.menu.speed.8=8 MHz (No USB)
Dragonfly-L476RE.menu.speed.8.build.f_cpu=8000000L
Dragonfly-L476RE.menu.speed.4=4 MHz (No USB)
Dragonfly-L476RE.menu.speed.4.build.f_cpu=4000000L
Dragonfly-L476RE.menu.speed.2=2 MHz (No USB)
Dragonfly-L476RE.menu.speed.2.build.f_cpu=2000000L
Dragonfly-L476RE.menu.speed.1=1 MHz (No USB)
Dragonfly-L476RE.menu.speed.1.build.f_cpu=1000000L

Dragonfly-L476RE.menu.opt.os=Smallest Code
Dragonfly-L476RE.menu.opt.os.build.flags.optimize=-Os
Dragonfly-L476RE.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Dragonfly-L476RE.menu.opt.o1=Fast
Dragonfly-L476RE.menu.opt.o1.build.flags.optimize=-O1
Dragonfly-L476RE.menu.opt.o1.build.flags.ldspecs=
Dragonfly-L476RE.menu.opt.o2=Faster
Dragonfly-L476RE.menu.opt.o2.build.flags.optimize=-O2
Dragonfly-L476RE.menu.opt.o2.build.flags.ldspecs=
Dragonfly-L476RE.menu.opt.o3=Fastest
Dragonfly-L476RE.menu.opt.o3.build.flags.optimize=-O3
Dragonfly-L476RE.menu.opt.o3.build.flags.ldspecs=

# Tlera Dragonfly (V2)
# ---------------------------------------
Dragonfly-L496RG.name=Dragonfly-L496RG
Dragonfly-L496RG.vid.0=0x1209
Dragonfly-L496RG.pid.0=0x6666

Dragonfly-L496RG.upload.tool=stm32l4_dfu
Dragonfly-L496RG.upload.protocol=dfu
Dragonfly-L496RG.upload.maximum_size=1032192
Dragonfly-L496RG.upload.use_1200bps_touch=true
Dragonfly-L496RG.upload.wait_for_upload_port=false
Dragonfly-L496RG.upload.native_usb=false

Dragonfly-L496RG.build.mcu=cortex-m4
Dragonfly-L496RG.build.f_cpu=80000000L
Dragonfly-L496RG.build.board=STM32L4_DRAGONFLY
Dragonfly-L496RG.build.arch=STM32L4
Dragonfly-L496RG.build.core=stm32l4
Dragonfly-L496RG.build.vid=0x1209
Dragonfly-L496RG.build.pid=0x6666
Dragonfly-L496RG.build.did=0xffff
Dragonfly-L496RG.build.usb_manufacturer="Tlera Corporation"
Dragonfly-L496RG.build.usb_product="Dragonfly"
Dragonfly-L496RG.build.extra_flags=-DSTM32L496xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Dragonfly-L496RG.build.ldscript=linker_scripts/STM32L496RG_FLASH.ld
Dragonfly-L496RG.build.openocdscript=openocd_scripts/stm32l496rg_dragonfly.cfg
Dragonfly-L496RG.build.variant=STM32L496RG-Dragonfly
Dragonfly-L496RG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l496 -larm_cortexM4lf_math
Dragonfly-L496RG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Dragonfly-L496RG.menu.usb.cdc=Serial
Dragonfly-L496RG.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Dragonfly-L496RG.menu.usb.cdc_msc=Serial + Mass Storage
Dragonfly-L496RG.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Dragonfly-L496RG.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Dragonfly-L496RG.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Dragonfly-L496RG.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
Dragonfly-L496RG.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Dragonfly-L496RG.menu.usb.none=No USB
Dragonfly-L496RG.menu.usb.none.build.usb_type=USB_TYPE_NONE

Dragonfly-L496RG.menu.dosfs.sflash=SFLASH (QSPI)
Dragonfly-L496RG.menu.dosfs.sflash.build.dosfs_sdcard=0
Dragonfly-L496RG.menu.dosfs.sflash.build.dosfs_sflash=2
Dragonfly-L496RG.menu.dosfs.sdspi=SDCARD (SPI)
Dragonfly-L496RG.menu.dosfs.sdspi.build.dosfs_sdcard=1
Dragonfly-L496RG.menu.dosfs.sdspi.build.dosfs_sflash=0
Dragonfly-L496RG.menu.dosfs.sdmmc=SDCARD (SDIO Default Speed)
Dragonfly-L496RG.menu.dosfs.sdmmc.build.dosfs_sdcard=2
Dragonfly-L496RG.menu.dosfs.sdmmc.build.dosfs_sflash=0
Dragonfly-L496RG.menu.dosfs.sdmmc1=SDCARD (SDIO High Speed)
Dragonfly-L496RG.menu.dosfs.sdmmc1.build.dosfs_sdcard=3
Dragonfly-L496RG.menu.dosfs.sdmmc1.build.dosfs_sflash=0
Dragonfly-L496RG.menu.dosfs.none=None
Dragonfly-L496RG.menu.dosfs.none.build.dosfs_sdcard=0
Dragonfly-L496RG.menu.dosfs.none.build.dosfs_sflash=0

